## web请求过程
---

####b/s架构过程的好处：
* 客户端的统一，客户端本身的继承性，带来的交互性。
* 服务端统一的http服务。

---
#### 架构概述
HTTP采用的短连接就是为了同事服务更多用户。
同时满足快速响应和服务更多用户，所以网络架构越来越复杂。

发起一个http请求就是一个简历socket连接的过程。

#### HTTP解析过程

* 工具
* 浏览器缓存机制，以及设置不缓存

#### DNS域名解析过程：
1. 查询浏览器缓存
2. 查询系统缓存。（系统会有一个host文件做dns缓存）
3. 系统去查询本地区的域名服务器（设置dns的时候会有这个）
4. 本地域域名服务器查询跟服务器请求解析。
5. 跟域名服务器返回本地域服务器一个主域名服务器地址。
6. 本地域服务器向主域名服务器发送请求。
7. 主域名服务器查询
8. 返回本地域服务器一个ip地址。
9. 本地域服务器缓存住这个地址。
10. 解析的结果返回给用户。

可以将多个域名解析到同一台服务器上，但是不能将一个域名解析到多个ip上。

#### CDN工作机制
内容分布网络=镜像+缓存+整体负载均衡。
目前以缓存网站中的静态资源为主。

要达到三个目标：可扩展性、安全性、可靠性、响应和执行。
